Repository: carlostarrats/Control-LLM
Catalog: Control LLM/*.lproj/Localizable.strings
Languages: es, fr

source: This app stores all data on your device only - nothing is saved or shared, and no account exists.
es: Esta aplicación almacena todos los datos solo en tu dispositivo - no se guarda ni comparte nada, y no existe una cuenta.

source: I Understand
es: Entiendo

source: Begin...
es: Comenzar...

source: Clipboard Processing
es: Procesamiento del Portapapeles

source: Retry
es: Reintentar

source: Copied
es: Copiado

source: Toggle Animation
es: Alternar Animación

source: INTERFACE
es: INTERFAZ

source: SETTINGS
es: CONFIGURACIÓN

source: MODELS
es: MODELOS

source: APPEARANCE
es: APARIENCIA

source: CREDITS
es: CRÉDITOS

source: No Installed Models
es: Sin Modelos Instalados

source: All Models Installed
es: Todos los Modelos Instalados

source: File Processing
es: Procesamiento de Archivos

source: The app supports these file types: .txt, .md, .rtf, .pdf, .jpg, .jpeg, .png, .heic, .doc, .docx. For documents and images with text, the app uses rule-based text analysis and pattern matching rather than LLM processing. This approach is fast and efficient, though the analysis is limited compared to what larger cloud-based models can provide.
es: La aplicación admite estos tipos de archivos: .txt, .md, .rtf, .pdf, .jpg, .jpeg, .png, .heic, .doc, .docx. Para documentos e imágenes con texto, la aplicación utiliza análisis de texto basado en reglas y coincidencia de patrones en lugar del procesamiento LLM. Este enfoque es rápido y eficiente, aunque el análisis es limitado en comparación con lo que pueden proporcionar los modelos más grandes basados en la nube.

source: Multiple models are available in Settings. Each model has different strengths, so you may find one works better than another depending on your specific needs.
es: Hay varios modelos disponibles en Configuración. Cada modelo tiene diferentes fortalezas, por lo que podrías encontrar que uno funciona mejor que otro según tus necesidades específicas.

source: AVAILABLE
es: DISPONIBLE

source: PROCESSING...
es: PROCESANDO...

source: MODEL
es: MODELO

source: STATUS
es: ESTADO

source: MEMORY
es: MEMORIA

source: ORGANIZING FILE
es: ORGANIZANDO ARCHIVOS

source: OPEN SOURCE
es: CÓDIGO ABIERTO

source: SYSTEM
es: SISTEMA

source: SETUP
es: CONFIGURACIÓN

source: INITIALIZATION PROGRESS:
es: PROGRESO DE INICIALIZACIÓN:

source: SETUP & INITIALIZATION
es: CONFIGURACIÓN E INICIALIZACIÓN

source: content.
es: contenido.

source: This app uses AI models that may generate incorrect, inappropriate, or misleading content. Do not rely on AI-generated content for legal, financial, or medical advice. This software is provided "as is" without warranties. For personal use only.
es: Esta aplicación utiliza modelos de IA que pueden generar contenido incorrecto, inapropiado o engañoso. No confíes en el contenido generado por IA para consejos legales, financieros o médicos. Este software se proporciona "tal como está" sin garantías. Solo para uso personal.

source: Tap to continue
es: Toca para continuar

source: Queued
es: En cola

source: In Use
es: En uso

source: > INITIALIZING METAL BACKEND...
es: > INICIALIZANDO BACKEND METAL...

source: > COMPILING SHADER KERNELS...
es: > COMPILANDO NÚCLEOS SHADER...

source: > FINALIZING AI ENGINE...
es: > FINALIZANDO MOTOR IA...

source: > SETUP COMPLETE
es: > CONFIGURACIÓN COMPLETA

source: > OPTIMIZING MATRIX OPERATIONS...
es: > OPTIMIZANDO OPERACIONES MATRICIALES...

source: > LOADING QUANTIZATION TABLES...
es: > CARGANDO TABLAS DE CUANTIZACIÓN...

source: > PREPARING MEMORY POOLS...
es: > PREPARANDO POOLS DE MEMORIA...

source: > CACHING COMPILED SHADERS...
es: > GUARDANDO EN CACHE SHADERS COMPILADOS...

source: > VALIDATING KERNEL FUNCTIONS...
es: > VALIDANDO FUNCIONES DE NÚCLEOS...

source: > COMPLETING OPTIMIZATION...
es: > COMPLETANDO OPTIMIZACIÓN...

source: > FINALIZING METAL KERNELS...
es: > FINALIZANDO NÚCLEOS METAL...

source: > OPTIMIZING GPU MEMORY...
es: > OPTIMIZANDO MEMORIA GPU...

source: > PREPARING INFERENCE ENGINE...
es: > PREPARANDO MOTOR DE INFERENCIA...

source: FAQs
fr: FAQ

source: Control
fr: Contrôle

source: Error
fr: Erreur

# Control LLM
source: Control
fr: Control LLM

source: Error: %@
fr: Erreur : %@

source: No chat history is saved. Messages in the chat window gradually fade over 7 days until completely erased, ensuring complete privacy and freeing up device storage.
fr: Aucun historique de discussion n'est enregistré. Les messages dans la fenêtre de discussion disparaissent progressivement sur 7 jours jusqu'à leur suppression complète, garantissant une confidentialité totale et libérant de l'espace de stockage sur l'appareil.
