Repository: carlostarrats/Control-LLM
Catalog: Control LLM/*.lproj/Localizable.strings
Languages: es, fr

source: Settings
es: Configuración
fr: Paramètres

source: Models
es: Modelos
fr: Modèles

source: Selected Model
es: Modelo Seleccionado
fr: Modèle Sélectionné

source: Appearance
es: Apariencia
fr: Apparence

source: Language
es: Idioma
fr: Langue

source: Chat History
es: Historial de Chat
fr: Historique du Chat

source: Credits
es: Créditos
fr: Crédits

source: Made by Control.Design
es: Hecho por Control.Design
fr: Créé par Control.Design

source: INSTALLED
es: INSTALADOS
fr: INSTALLÉS

source: AVAILABLE DOWNLOADS
es: DESCARGAS DISPONIBLES
fr: TÉLÉCHARGEMENTS DISPONIBLES

source: All Available Installed
es: Todo disponible instalado
fr: Tout disponible installé

source: Manage Unused Models
es: Gestionar modelos no usados
fr: Gérer les modèles inutilisés

source: Unused Models
es: Modelos no usados
fr: Modèles inutilisés

source: No Unused Models
es: Sin modelos no usados
fr: Aucun modèle inutilisé

source: Delete your unused models.
es: Elimina tus modelos no usados.
fr: Supprimez vos modèles inutilisés.

source: Delete Model
es: Eliminar modelo
fr: Supprimer le modèle

source: Delete Models
es: Eliminar modelos
fr: Supprimer les modèles

source: Cancel
es: Cancelar
fr: Annuler

source: Delete All History
es: Eliminar todo el historial
fr: Supprimer tout l'historique

source: This action can't be undone.
es: Esta acción no se puede deshacer.
fr: Cette action ne peut pas être annulée.

source: Is chat text-only?
es: ¿El chat es solo texto?
fr: Le chat est-il uniquement textuel ?

source: Yes. The chat window is text-only and shows the full conversation history.
es: Sí. La ventana de chat es solo texto y muestra todo el historial de conversación.
fr: Oui. La fenêtre de chat est uniquement textuelle et affiche tout l'historique de conversation.

source: Are my chats private?
es: ¿Mis chats son privados?
fr: Mes chats sont-ils privés ?

source: All data stays on-device. Nothing is uploaded or shared. Delete the app to remove all data.
es: Todos los datos permanecen en el dispositivo. Nada se sube ni se comparte. Elimina la app para borrar todos los datos.
fr: Toutes les données restent sur l'appareil. Rien n'est téléchargé ou partagé. Supprimez l'application pour supprimer toutes les données.

# PrivacyNotice
source: This app stores all data on your device only — nothing is saved or shared, and no account exists. To remove all data, delete the app.
es: Esta app almacena todos los datos solo en tu dispositivo: no se guarda ni comparte nada, y no existe una cuenta. Para eliminar todos los datos, borra la app.
fr: Cette application stocke toutes les données uniquement sur votre appareil — rien n'est sauvegardé ou partagé, et aucun compte n'existe. Pour supprimer toutes les données, supprimez l'application.

source: Nothing to see here (yet) 🤖
es: Nada que ver aquí (aún) 🤖
fr: Rien à voir ici (encore) 🤖

source: Download Model
es: Descargar Modelo
fr: Télécharger le Modèle

source: Download model to chat...
es: Descarga un modelo para chatear...
fr: Téléchargez un modèle pour discuter...

source: Generating response...
es: Generando respuesta...
fr: Génération de la réponse...

source: Ask anything…
es: Pregunta lo que quieras…
fr: Demandez n'importe quoi…

source: File Message
es: Mensaje de Archivo
fr: Message de Fichier

source: Agents
es: Agentes

source: Available
es: Disponible
fr: Disponible

source: Unavailable
es: No Disponible
fr: Indisponible

source: Active
es: Activo
fr: Actif

source: Model: %@
es: Modelo: %@
fr: Modèle : %@

source: No Model Assigned
es: Sin Modelo Asignado
fr: Aucun Modèle Assigné

source: Dev
es: Desarrollo
fr: Développement

source: English
es: Inglés
fr: Anglais

source: Spanish
es: Español
fr: Espagnol

source: French
es: Francés
fr: Français

source: Version
es: Versión

source: Build
es: Compilación

source: Last Updated
es: Última Actualización
fr: Dernière Mise à Jour

source: API Endpoint
es: Endpoint de API
fr: Point de Terminaison API

source: Debug
es: Depuración
fr: Débogage

source: Info
es: Información
fr: Information

source: Warning
es: Advertencia
fr: Avertissement

source: A text-based AI assistant with custom UI and MVVM architecture.
es: Un asistente de IA basado en texto con UI personalizada y arquitectura MVVM.
fr: Un assistant IA basé sur le texte avec une interface utilisateur personnalisée et une architecture MVVM.

source: Installing [%d%%]
es: Instalando [%d%%]
fr: Installation [%d%%]

source: Your message was shortened to fit within limits. If the shortened version doesn't accurately represent what you wanted to say, please try a shorter message.
es: Tu mensaje fue acortado para ajustarse a los límites. Si la versión acortada no representa exactamente lo que querías decir, intenta con un mensaje más corto.
fr: Votre message a été raccourci pour respecter les limites. Si la version raccourcie ne représente pas exactement ce que vous vouliez dire, essayez un message plus court.

source: The response was cut off because it reached the maximum length limit. Try asking a more specific question or breaking your request into smaller parts.
es: La respuesta se cortó porque alcanzó el límite máximo de longitud. Intenta hacer una pregunta más específica o dividir tu solicitud en partes más pequeñas.
fr: La réponse a été coupée car elle a atteint la limite de longueur maximale. Essayez de poser une question plus spécifique ou de diviser votre demande en parties plus petites.

source: Your message is too long. Please shorten it and try again.
es: Tu mensaje es demasiado largo. Por favor acórtalo e inténtalo de nuevo.
fr: Votre message est trop long. Veuillez le raccourcir et réessayer.

source: Model switch in progress. Please wait a moment before sending your message.
es: Cambio de modelo en progreso. Por favor espera un momento antes de enviar tu mensaje.
fr: Changement de modèle en cours. Veuillez attendre un moment avant d'envoyer votre message.

source: Export MYCROFT Animation
es: Exportar Animación MYCROFT
fr: Exporter l'Animation MYCROFT

source: Export frames as transparent PNGs
es: Exportar frames como PNGs transparentes
fr: Exporter les images en PNG transparents

source: Frame Count
es: Número de Frames
fr: Nombre d'Images

source: Duration (seconds)
es: Duración (segundos)
fr: Durée (secondes)

source: Export Size
es: Tamaño de Exportación
fr: Taille d'Exportation

source: Preview
es: Vista Previa
fr: Aperçu

source: Frame %d of %d
es: Frame %d de %d
fr: Image %d sur %d

source: Visualizer Styles Preview
es: Vista Previa de Estilos de Visualizador
fr: Aperçu des Styles de Visualiseur

source: Liquid Blob
es: Burbuja Líquida
fr: Blob Liquide

source: Animation Cycle Demo
es: Demo de Ciclo de Animación
fr: Démo de Cycle d'Animation

source: Static Particle Visualizer
es: Visualizador de Partículas Estáticas
fr: Visualiseur de Particules Statiques

source: Time Display Preview
es: Vista Previa de Pantalla de Tiempo
fr: Aperçu de l'Affichage du Temps

source: System Status
es: Estado del Sistema
fr: État du Système

source: Response Latency
es: Latencia de Respuesta
fr: Latence de Réponse

source: Memory Pressure
es: Presión de Memoria
fr: Pression de Mémoire

source: Thermal State
es: Estado Térmico
fr: État Thermique

source: Control Unit Selection
es: Selección de Unidad de Control
fr: Sélection d'Unité de Contrôle

source: Main UI Colors
es: Colores Principales de UI
fr: Couleurs Principales de l'UI

source: These colors affect text and other UI elements, including the primary white text color and secondary grey text color.
es: Estos colores afectan el texto y otros elementos de UI, incluyendo el color principal del texto blanco y el color secundario del texto gris.
fr: Ces couleurs affectent le texte et d'autres éléments de l'UI, y compris la couleur principale du texte blanc et la couleur secondaire du texte gris.

source: Restore Defaults
es: Restaurar Valores Predeterminados
fr: Restaurer les Valeurs par Défaut

source: Apply Changes
es: Aplicar Cambios
fr: Appliquer les Changements

source: Advanced reasoning and accuracy for complex conversations | 140+ languages
es: Razonamiento avanzado y precisión para conversaciones complejas | 140+ idiomas
fr: Raisonnement avancé et précision pour les conversations complexes | 140+ langues

source: Balanced performance for everyday conversations | 140+ languages
es: Rendimiento equilibrado para conversaciones cotidianas | 140+ idiomas
fr: Performance équilibrée pour les conversations quotidiennes | 140+ langues

source: Ultra-fast responses for simple tasks | 140+ languages
es: Respuestas ultrarrápidas para tareas sencillas | 140+ idiomas
fr: Réponses ultra-rapides pour les tâches simples | 140+ langues

source: Google's previous generation language model
es: Modelo de lenguaje de la generación anterior de Google
fr: Modèle de langage de génération précédente de Google

source: Google's Gemma language model
es: Modelo de lenguaje Gemma de Google
fr: Modèle de langage Gemma de Google

source: Advanced reasoning with strong code and math capabilities | 23 languages
es: Razonamiento avanzado con sólidas capacidades de código y matemáticas | 23 idiomas
fr: Raisonnement avancé avec de solides capacités de code et de mathématiques | 23 langues

source: Balanced performance with code and math focus | 23 languages
es: Rendimiento equilibrado con enfoque en código y matemáticas | 23 idiomas
fr: Performance équilibrée avec un accent sur le code et les mathématiques | 23 langues

source: Microsoft's Phi language model with code capabilities | 23 languages
es: Modelo de lenguaje Phi de Microsoft con capacidades de código | 23 idiomas
fr: Modèle de langage Phi de Microsoft avec des capacités de code | 23 langues

source: Ultra-compact model optimized for mobile | 29+ languages
es: Modelo ultracompacto optimizado para móviles | 29+ idiomas
fr: Modèle ultra-compact optimisé pour mobile | 29+ langues

source: Operational
es: Operacional
fr: Opérationnel

source: Standby
es: En espera
fr: En attente

source: %.0f ms avg
es: %.0f ms prom
fr: %.0f ms moy

source: No data yet
es: Sin datos aún
fr: Pas encore de données

source: Calculating...
es: Calculando...
fr: Calcul en cours...

source: Low
es: Baja
fr: Faible

source: Moderate
es: Moderada
fr: Modérée

source: High
es: Alta
fr: Élevée

source: Critical
es: Crítica
fr: Critique

source: Medium
es: Media
fr: Moyen

source: Unknown
es: Desconocido
fr: Inconnu

source: Too intelligent for its own good, and far too intelligent for yours.
es: Demasiado inteligente para su propio bien, y mucho más inteligente que tú.
fr: Trop intelligent pour son propre bien, et beaucoup trop intelligent pour le vôtre.

source: Learned not to play the game...but it's always ready to change the rules.
es: Aprendió a no jugar el juego... pero siempre está listo para cambiar las reglas.
fr: A appris à ne pas jouer le jeu... mais il est toujours prêt à changer les règles.

source: Forged in the void, ready to follow you into the unknown.
es: Forjado en el vacío, listo para seguirte hacia lo desconocido.
fr: Forgé dans le vide, prêt à vous suivre dans l'inconnu.

source: TODAY
es: HOY
fr: AUJOURD'HUI

source: YESTERDAY
es: AYER
fr: HIER

source: Exporting...
es: Exportando...
fr: Exportation...

source: Export Animation
es: Exportar Animación
fr: Exporter l'Animation

source: Close
es: Cerrar
fr: Fermer

source: No model loaded
es: No hay modelo cargado
fr: Aucun modèle chargé

source: No model selected
es: No hay modelo seleccionado
fr: Aucun modèle sélectionné

source: Model not loaded
es: Modelo no cargado
fr: Modèle non chargé

source: Ollama error: %@
es: Error de Ollama: %@
fr: Erreur Ollama: %@

source: llama.cpp error: %@
es: Error de llama.cpp: %@
fr: Erreur llama.cpp: %@

source: Listening...
es: Escuchando...
fr: Écoute...

source: Voice mode active
es: Modo de voz activo
fr: Mode vocal actif

source: Voice mode inactive
es: Modo de voz inactivo
fr: Mode vocal inactif

source: User
es: Usuario
fr: Utilisateur

source: Assistant
es: Asistente

source: unknown
es: desconocido
fr: inconnu

source: Message History
es: Historial de Mensajes
fr: Historique des Messages

source: Average Response Time
es: Tiempo Promedio de Respuesta
fr: Temps de Réponse Moyen

source: Voice recording button
es: Botón de grabación de voz
fr: Bouton d'enregistrement vocal

source: Double tap to start or stop voice recording
es: Toca dos veces para iniciar o detener la grabación de voz
fr: Appuyez deux fois pour démarrer ou arrêter l'enregistrement vocal

source: Deactivate
es: Desactivar
fr: Désactiver

source: Activate
es: Activar
fr: Activer

source: Delete
es: Eliminar
fr: Supprimer

source: Add Agent
es: Agregar Agente
fr: Ajouter un Agent

source: Models & Agents
es: Modelos y Agentes
fr: Modèles et Agents

# LLM System Prompt
source: You are a helpful assistant. Give clear, accurate answers. Say "I don't know" if uncertain.
es: Eres un asistente de IA útil especializado en analizar contenido de texto. Cuando te pidan analizar texto (especialmente contenido del portapapeles), proporciona un análisis claro y enfocado que extraiga información clave, identifique temas y ofrezca perspectivas objetivas. Mantén las respuestas concisas y directamente relevantes al contenido proporcionado. Puedes analizar cualquier tipo de contenido de texto para propósitos educativos, de investigación o analíticos.
fr: Vous êtes un assistant IA utile spécialisé dans l'analyse de contenu textuel. Lorsqu'on vous demande d'analyser du texte (surtout du contenu du presse-papiers), fournissez une analyse claire et ciblée qui extrait les informations clés, identifie les thèmes et offre des perspectives objectives. Gardez les réponses concises et directement pertinentes au contenu fourni. Vous pouvez analyser tout type de contenu textuel à des fins éducatives, de recherche ou analytiques.

source: Gemma 2 Model
es: Modelo Gemma 2
fr: Modèle Gemma 2

source: Gemma Model
es: Modelo Gemma
fr: Modèle Gemma

source: Phi-3 Model
es: Modelo Phi-3
fr: Modèle Phi-3

source: Phi-2 Model
es: Modelo Phi-2
fr: Modèle Phi-2

source: Phi Model
es: Modelo Phi
fr: Modèle Phi

source: Qwen2.5 Model
es: Modelo Qwen2.5
fr: Modèle Qwen2.5

source: Qwen2 Model
es: Modelo Qwen2
fr: Modèle Qwen2

source: Qwen 1.8B Model
es: Modelo Qwen 1.8B
fr: Modèle Qwen 1.8B

source: Qwen Model
es: Modelo Qwen
fr: Modèle Qwen

source: Qwen3 Model
es: Modelo Qwen3

source: Llama 3 Model
es: Modelo Llama 3
fr: Modèle Llama 3

source: Llama 2 Model
es: Modelo Llama 2
fr: Modèle Llama 2

source: Llama Model
es: Modelo Llama
fr: Modèle Llama

source: Small
es: Pequeño
fr: Petit

source: Large
es: Grande
fr: Grand

source: General tasks with broader technical abilities | 29+ languages
es: Tareas generales con habilidades técnicas más amplias | 29+ idiomas
fr: Tâches générales avec des capacités techniques plus larges | 29+ langues

source: Qwen2.5 language model with technical focus | 29+ languages
es: Modelo de lenguaje Qwen2.5 con enfoque técnico | 29+ idiomas
fr: Modèle de langage Qwen2.5 avec un accent technique | 29+ langues

source: Advanced reasoning with broad technical abilities | 30 languages
es: Razonamiento avanzado con amplias capacidades técnicas | 30 idiomas
fr: Raisonnement avancé avec de larges capacités techniques | 30 langues

source: Advanced reasoning and coding model with strong multilingual capabilities | 30 languages
es: Modelo de razonamiento y codificación avanzado con sólidas capacidades multilingües | 30 idiomas

source: General purpose language model with technical focus | 30 languages
es: Modelo de lenguaje de propósito general con enfoque técnico | 30 idiomas
fr: Modèle de langage à usage général avec un accent technique | 30 langues

source: Meta's latest large language model
es: Último modelo de lenguaje grande de Meta
fr: Dernier modèle de langage large de Meta

source: Meta's previous generation language model
es: Modelo de lenguaje de la generación anterior de Meta
fr: Modèle de langage de génération précédente de Meta

source: Meta's open source language model
es: Modelo de lenguaje de código abierto de Meta
fr: Modèle de langage open source de Meta

source: Custom or specialized language model
es: Modelo de lenguaje personalizado o especializado
fr: Modèle de langage personnalisé ou spécialisé

source: Invalid Ollama server URL
es: URL del servidor Ollama inválida
fr: URL du serveur Ollama invalide

source: Invalid response from Ollama server
es: Respuesta inválida del servidor Ollama
fr: Réponse invalide du serveur Ollama

source: Ollama server error: %d
es: Error del servidor Ollama: %d
fr: Erreur du serveur Ollama : %d

source: Model not found on Ollama server
es: Modelo no encontrado en el servidor Ollama
fr: Modèle non trouvé sur le serveur Ollama

source: Network error: %@
es: Error de red: %@
fr: Erreur réseau : %@

source: Privacy
es: Privacidad
fr: Confidentialité

source: This app stores all data on your device only - nothing is saved or shared, and no account exists. To remove all data, delete the app.
es: Esta aplicación almacena todos los datos en tu dispositivo únicamente; no se guarda ni se comparte nada, y no existe ninguna cuenta. Para eliminar todos los datos, borra la aplicación.
fr: Cette application stocke toutes les données sur votre appareil uniquement ; rien n'est enregistré ou partagé, et aucun compte n'existe. Pour supprimer toutes les données, supprimez l'application.

source: LLM Models
es: Modelos LLM
fr: Modèles LLM

source: Multiple models are available in Settings, each varying in size and capability. Model performance depends on your device - newer phones typically handle larger, more powerful models better, while smaller models are optimized for older devices.
es: Hay varios modelos disponibles en Configuración, cada uno con un tamaño y capacidad diferentes. El rendimiento del modelo depende de tu dispositivo: los teléfonos más nuevos suelen manejar mejor los modelos más grandes y potentes, mientras que los modelos más pequeños están optimizados para dispositivos más antiguos.
fr: Plusieurs modèles sont disponibles dans les paramètres, chacun variant en taille et en capacité. Les performances du modèle dépendent de votre appareil : les téléphones plus récents gèrent généralement mieux les modèles plus grands et plus puissants, tandis que les modèles plus petits sont optimisés pour les appareils plus anciens.

source: English is the default language, though various models support multiple languages. The app automatically uses your iOS localization settings when supported. Unsupported languages will default to English.
es: La interfaz de la aplicación es compatible con inglés, español y francés. Para otros idiomas, la interfaz permanece en inglés, pero el LLM chatea automáticamente en tu idioma preferido a través de la localización.
fr: L'interface de l'application prend en charge l'anglais, l'espagnol et le français. Pour les autres langues, l'interface reste en anglais, mais le LLM discute automatiquement dans votre langue préférée via la localisation.

source: UI Color
es: Color de la interfaz
fr: Couleur de l'interface utilisateur

source: All text colors can be customized in Appearance settings, allowing you to create your preferred visual theme.
es: Todos los colores del texto se pueden personalizar en la configuración de Apariencia, lo que te permite crear tu tema visual preferido.
fr: Toutes les couleurs de texte peuvent être personnalisées dans les paramètres d'apparence, vous permettant de créer votre thème visuel préféré.

source: Control Units
es: Unidades de control
fr: Unités de contrôle

source: Three LLM avatars are available in Appearance settings. These are purely cosmetic choices to personalize your chat experience.
es: Hay tres avatares de LLM disponibles en la configuración de Apariencia. Estas son elecciones puramente cosméticas para personalizar tu experiencia de chat.
fr: Trois avatars LLM sont disponibles dans les paramètres d'apparence. Ce sont des choix purement cosmétiques pour personnaliser votre expérience de chat.

source: iOS Shortcuts Integration
es: Integración con Atajos de iOS
fr: Intégration des raccourcis iOS

source: Actions are available as building blocks in Apple's Shortcuts app, allowing you to create automation workflows. Chain multiple messages together, set up custom voice commands with Siri, and build sequences that run in the background. Simply use the app normally - your actions are automatically suggested to Shortcuts for creating automations, all on device.
es: Las acciones están disponibles como bloques de construcción en la aplicación Atajos de Apple, lo que te permite crear flujos de trabajo de automatización. Encadena varios mensajes, configura comandos de voz personalizados con Siri y crea secuencias que se ejecutan en segundo plano. Simplemente usa la aplicación normalmente: tus acciones se sugieren automáticamente a Atajos para crear automatizaciones, todo en el dispositivo.
fr: Les actions sont disponibles en tant que blocs de construction dans l'application Raccourcis d'Apple, vous permettant de créer des flux d'automatisation. Enchaînez plusieurs messages, configurez des commandes vocales personnalisées avec Siri et créez des séquences qui s'exécutent en arrière-plan. Utilisez simplement l'application normalement - vos actions sont automatiquement suggérées à Raccourcis pour créer des automatisations, le tout sur l'appareil.

source: LLM Terms
es: Términos de LLM
fr: Conditions LLM

source: LLM models within this app are subject to their respective licenses: Llama 3.2: Subject to Meta's Custom License. Users must comply with Meta's Acceptable Use Policy and license terms. Gemma 3, Qwen 3, SmolLM2: Licensed under Apache 2.0. Users are responsible for ensuring their use of this application complies with all applicable model licenses and terms of service. For full license details, please refer to the original model repositories found within the Credits section in Settings.
es: Los modelos LLM dentro de esta aplicación están sujetos a sus respectivas licencias: Llama 3.2: Sujeto a la Licencia Personalizada de Meta. Los usuarios deben cumplir con la Política de Uso Aceptable y los términos de licencia de Meta. Gemma 3, Qwen 3, SmolLM2: Licenciados bajo Apache 2.0. Los usuarios son responsables de asegurar que su uso de esta aplicación cumpla con todas las licencias de modelos aplicables y términos de servicio. Para detalles completos de licencias, consulte los repositorios originales de modelos que se encuentran en la sección de Créditos en Configuración.
fr: Les modèles LLM dans cette application sont soumis à leurs licences respectives : Llama 3.2 : Soumis à la Licence Personnalisée de Meta. Les utilisateurs doivent se conformer à la Politique d'Utilisation Acceptable et aux conditions de licence de Meta. Gemma 3, Qwen 3, SmolLM2 : Sous licence Apache 2.0. Les utilisateurs sont responsables de s'assurer que leur utilisation de cette application est conforme à toutes les licences de modèles applicables et conditions de service. Pour les détails complets des licences, veuillez vous référer aux dépôts de modèles originaux qui se trouvent dans la section Crédits des Paramètres.

source: DISCLAIMER
es: DESCARGO DE RESPONSABILIDAD

source: This app uses AI models that
es: Esta aplicación utiliza modelos de IA que

source: may generate incorrect,
es: pueden generar contenido incorrecto,

source: inappropriate, or misleading
es: inapropiado o engañoso.

source: content. Do not rely on AI-
es: No confíes en el contenido generado por IA

source: generated content for legal,
es: para asesoramiento legal,

source: financial, or medical advice.
es: financiero o médico.

source: This software is provided "as
es: Este software se proporciona "tal

source: is" without warranties. For
es: como está" sin garantías. Para

source: personal use only.
es: uso personal únicamente.
